## DataFrame Mini Project: Predict Gender from Name

# Part 1

##  Table of Contents
* required-libraries
* generate-fake-data
* extract-firstname-and-lastname
* predict-gender
* gender probability
* country
* country probability

In this project we want to generate a fake dataset and predict gender from their names. For example a name like 'زهرا' looks like female

## required-libraries

In [6]:
from faker import Faker

In [7]:
from names_dataset import NameDataset

In [24]:
#english name
english_name_fake = Faker()
english_name_fake.name()

'Laura Campbell'

In [25]:
#farsi name
persisn_name_fake = Faker('Fa')
persisn_name_fake.name()

'باران عزیزی'

In [11]:
from names_dataset import NameDataset
# This line takes time some time as the database is massive.

In [12]:
name_data_set = NameDataset()
name_data_set

In [13]:
name_data_set.search('زهرا')

{'first_name': {'country': {'Afghanistan': 0.115,
   'Algeria': 0.012,
   'Egypt': 0.045,
   'Iraq': 0.178,
   'Iran, Islamic Republic of': 0.416,
   'Saudi Arabia': 0.095,
   'Sudan': 0.041,
   'Syrian Arab Republic': 0.05,
   'Turkey': 0.036,
   'Yemen': 0.013},
  'gender': {'Female': 0.919, 'Male': 0.081},
  'rank': {'Afghanistan': 203,
   'Egypt': 16220,
   'Iraq': 3684,
   'Iran, Islamic Republic of': 415,
   'Saudi Arabia': 11069,
   'Sudan': 7276,
   'Syrian Arab Republic': 4855,
   'Turkey': 7299,
   'Yemen': 8512,
   'Algeria': None}},
 'last_name': {'country': {'Afghanistan': 0.043,
   'Algeria': 0.045,
   'Egypt': 0.053,
   'Iraq': 0.256,
   'Iran, Islamic Republic of': 0.092,
   'Saudi Arabia': 0.089,
   'Sudan': 0.055,
   'Syrian Arab Republic': 0.243,
   'Turkey': 0.049,
   'Yemen': 0.075},
  'gender': {},
  'rank': {'Afghanistan': 2194,
   'Iraq': 8717,
   'Iran, Islamic Republic of': 6838,
   'Syrian Arab Republic': 5545,
   'Yemen': 9258,
   'Algeria': None,
   'Egypt': None,
   'Saudi Arabia': None,
   'Sudan': None,
   'Turkey': None}}}

In [17]:
name_data_set.search('زهرا')['first_name']['gender']

{'Female': 0.919, 'Male': 0.081}

In [18]:
name_data_set.search('زهرا')['first_name']['country']

{'Afghanistan': 0.115,
 'Algeria': 0.012,
 'Egypt': 0.045,
 'Iraq': 0.178,
 'Iran, Islamic Republic of': 0.416,
 'Saudi Arabia': 0.095,
 'Sudan': 0.041,
 'Syrian Arab Republic': 0.05,
 'Turkey': 0.036,
 'Yemen': 0.013}

In [19]:
name_data_set.search('zahra')['first_name']['country']

{'Algeria': 0.1,
 'Egypt': 0.108,
 'France': 0.037,
 'Iraq': 0.064,
 'Iran, Islamic Republic of': 0.15,
 'Morocco': 0.316,
 'Saudi Arabia': 0.119,
 'Syrian Arab Republic': 0.026,
 'Tunisia': 0.052,
 'United States': 0.028}

In [94]:
name_data_set.search('zahra')['last_name']['country']

{'United Arab Emirates': 0.018,
 'Algeria': 0.093,
 'Egypt': 0.092,
 'France': 0.021,
 'Iraq': 0.028,
 'Morocco': 0.529,
 'Malaysia': 0.059,
 'Saudi Arabia': 0.063,
 'Syrian Arab Republic': 0.036,
 'Tunisia': 0.062}

## Generate Fake Data

In [68]:
import pandas as pd
import numpy as np

In [69]:
def make_name():
    """
        This function generate an Iranian name in 50% of the times and
        an English name in the other 50% of the times.
    """
    return english_name_fake.name() if np.random.rand() > 0.5 else persisn_name_fake.name()

In [80]:
name = {
    'Name':[make_name() for _ in range(10)]
    }
df = pd.DataFrame(name)

In [81]:
df

                  Name
0     Julie Washington
1      امیرعباس تهرانی
2   Stephanie Crawford
3     Charles Anderson
4     Courtney Stewart
5          Andre Davis
6  Stephanie Rodriguez
7         Tina Simmons
8           اسرا زارعی
9        یلدا اکبر پور

## Extract First name and Last name

In [82]:
def name_to_gender(first_name):
    try:
        gender_dict = name_data_set.search(first_name)['first_name']['gender']
        return 'Femel' if gender_dict['Female'] > gender_dict['Male'] else 'Male'
    except:
           return None

In [83]:
df = df.assign(first_name = df['Name'].apply(lambda full_name: full_name.split()[0]))
df = df.assign(last_name = df['Name'].apply(lambda full_name: full_name.split()[1]))
df

                  Name first_name   last_name
0     Julie Washington      Julie  Washington
1      امیرعباس تهرانی   امیرعباس      تهرانی
2   Stephanie Crawford  Stephanie    Crawford
3     Charles Anderson    Charles    Anderson
4     Courtney Stewart   Courtney     Stewart
5          Andre Davis      Andre       Davis
6  Stephanie Rodriguez  Stephanie   Rodriguez
7         Tina Simmons       Tina     Simmons
8           اسرا زارعی       اسرا       زارعی
9        یلدا اکبر پور       یلدا        اکبر

## Predict Gender

In [84]:
def name_to_gender(first_name):
    try:
        gender_dict = name_data_set.search(first_name)['first_name']['gender']
        return 'Femel' if gender_dict['Female'] > gender_dict['Male'] else 'Male'
    except:
            return None

In [43]:
print(name_to_gender('محدثه'))

Femel

In [46]:
print(name_to_gender('jack'))

Male

In [85]:
df = df.assign(Gender = df['first_name'].apply(lambda x: name_to_gender(x)))

In [86]:
df

                  Name first_name   last_name Gender
0     Julie Washington      Julie  Washington  Femel
1      امیرعباس تهرانی   امیرعباس      تهرانی   Male
2   Stephanie Crawford  Stephanie    Crawford  Femel
3     Charles Anderson    Charles    Anderson   Male
4     Courtney Stewart   Courtney     Stewart  Femel
5          Andre Davis      Andre       Davis   Male
6  Stephanie Rodriguez  Stephanie   Rodriguez  Femel
7         Tina Simmons       Tina     Simmons  Femel
8           اسرا زارعی       اسرا       زارعی  Femel
9        یلدا اکبر پور       یلدا        اکبر  Femel

## Gender Probability

In [87]:
def name_to_gender_probabilty(first_name):
    try:
        gender_dict = name_data_set.search(first_name)['first_name']['gender']
        return gender_dict['Female'] if gender_dict['Female'] > gender_dict['Male'] else gender_dict['Male']
    except:
        return None

In [51]:
print(name_to_gender_probabilty('jack'))

0.968

In [52]:
print(name_to_gender_probabilty('zahra'))

0.96

In [88]:
df = df.assign(Gender_Probability = df['first_name'].apply(lambda x: name_to_gender_probabilty(x)))

In [89]:
df

                  Name first_name   last_name Gender  Gender_Probability
0     Julie Washington      Julie  Washington  Femel               0.991
1      امیرعباس تهرانی   امیرعباس      تهرانی   Male               0.953
2   Stephanie Crawford  Stephanie    Crawford  Femel               0.995
3     Charles Anderson    Charles    Anderson   Male               0.984
4     Courtney Stewart   Courtney     Stewart  Femel               0.890
5          Andre Davis      Andre       Davis   Male               0.934
6  Stephanie Rodriguez  Stephanie   Rodriguez  Femel               0.995
7         Tina Simmons       Tina     Simmons  Femel               0.986
8           اسرا زارعی       اسرا       زارعی  Femel               0.885
9        یلدا اکبر پور       یلدا        اکبر  Femel               0.851

## Country

In [106]:
def country(last_name):
    try:
        info = name_data_set.search(last_name)['last_name']
        return max(info['country'], key=info['country'].get)
    except:    
        return None

In [107]:
print(country('زارعی'))

Iran, Islamic Republic of

In [108]:
print(country('Davise'))

Nigeria

In [109]:
df = df.assign(Country = df['last_name'].apply(lambda x: country(x)))

In [110]:
df

,Name,first_name,last_name,Gender,Gender_Probability,Country
0,Julie Washington,Julie,Washington,Femel,0.991,United States
1,امیرعباس تهرانی,امیرعباس,تهرانی,Male,0.953,"Iran, Islamic Republic of"
2,Stephanie Crawford,Stephanie,Crawford,Femel,0.995,United States
3,Charles Anderson,Charles,Anderson,Male,0.984,United States
4,Courtney Stewart,Courtney,Stewart,Femel,0.890,United States
5,Andre Davis,Andre,Davis,Male,0.934,United States
6,Stephanie Rodriguez,Stephanie,Rodriguez,Femel,0.995,United States
7,Tina Simmons,Tina,Simmons,Femel,0.986,United States
8,اسرا زارعی,اسرا,زارعی,Femel,0.885,"Iran, Islamic Republic of"
9,یلدا اکبر پور,یلدا,اکبر,Femel,0.851,Saudi Arabia

## Country Probability

In [111]:
def country_probability(last_name):
    try:
        info = name_data_set.search(last_name)['last_name']
        country = max(info['country'], key=info['country'].get)
        return info['country'][country]
    except:    
        return None

In [113]:
df = df.assign(Country_Probability = df['last_name'].apply(lambda x: country_probability(x)))

In [115]:
df

,Name,first_name,last_name,Gender,Gender_Probability,Country,Country_Probability
0,Julie Washington,Julie,Washington,Femel,0.991,United States,0.901
1,امیرعباس تهرانی,امیرعباس,تهرانی,Male,0.953,"Iran, Islamic Republic of",0.846
2,Stephanie Crawford,Stephanie,Crawford,Femel,0.995,United States,0.582
3,Charles Anderson,Charles,Anderson,Male,0.984,United States,0.599
4,Courtney Stewart,Courtney,Stewart,Femel,0.890,United States,0.481
5,Andre Davis,Andre,Davis,Male,0.934,United States,0.729
6,Stephanie Rodriguez,Stephanie,Rodriguez,Femel,0.995,United States,0.289
7,Tina Simmons,Tina,Simmons,Femel,0.986,United States,0.720
8,اسرا زارعی,اسرا,زارعی,Femel,0.885,"Iran, Islamic Republic of",0.939
9,یلدا اکبر پور,یلدا,اکبر,Femel,0.851,Saudi Arabia,0.325

# Part 2

##  Table of Contents
* required-libraries
* extract Firstname
* Gender
* Gender probability
* Country
* Country probability

## required-libraries

In [168]:
import json
from collections import Counter

In [169]:
with open('./data/pytopia-chat-export.json') as f:
    data = json.load(f)

## Extract First name

In [170]:
names = []
id_set = set()
for msg in data['messages']:
    if not msg.get('from'):
        continue
    elif msg['from_id'] in id_set:
        continue
    else:
        id_set.add(msg['from_id'])
        names.append(msg['from'])

In [171]:
first_name = [i.split()[0].lower() for i in names]
first_name = list(filter(lambda fn: len(fn)> 2, first_name))
first_name = list(filter(lambda fn: fn.isalpha(), first_name))

Counter(first_name).most_common(20)

[('ali', 52),
 ('mohammad', 44),
 ('amir', 32),
 ('maryam', 25),
 ('zahra', 19),
 ('alireza', 18),
 ('fateme', 16),
 ('reza', 15),
 ('fatemeh', 14),
 ('mehdi', 13),
 ('mahdi', 12),
 ('sina', 12),
 ('erfan', 12),
 ('hossein', 11),
 ('masoud', 10),
 ('mahsa', 9),
 ('amin', 9),
 ('saeed', 8),
 ('mohammadreza', 8),
 ('milad', 8)]

In [172]:
df = pd.DataFrame(
    {
        'first_name':first_name
    }
)

In [173]:
df

      first_name
0         sobhan
1           good
2           sima
3            ali
4           mhmd
...          ...
1223        mary
1224       saeid
1225     ᴀᴍɪʀᴀʟɪ
1226         ali
1227  aristocles

[1228 rows x 1 columns]

In [174]:
df['first_name'].value_counts()

first_name
ali           52
mohammad      44
amir          32
maryam        25
zahra         19
              ..
afshin         1
naghme         1
sorena         1
hosna          1
aristocles     1
Name: count, Length: 593, dtype: int64

## Gender

In [175]:
df['Gender'] = df['first_name'].apply(name_to_gender)

In [176]:
df

      first_name Gender
0         sobhan   Male
1           good   Male
2           sima  Femel
3            ali   Male
4           mhmd   Male
...          ...    ...
1223        mary  Femel
1224       saeid   Male
1225     ᴀᴍɪʀᴀʟɪ   None
1226         ali   Male
1227  aristocles   None

[1228 rows x 2 columns]

In [177]:
df['Gender'].value_counts()

Gender
Male     642
Femel    469
Name: count, dtype: int64

In [178]:
df['Gender'].isna().sum()

117

## Gender Probability

In [179]:
df['Gender_Probability'] = df['first_name'].apply(name_to_gender_probabilty)

In [180]:
df

      first_name Gender  Gender_Probability
0         sobhan   Male               0.923
1           good   Male               0.713
2           sima  Femel               0.878
3            ali   Male               0.942
4           mhmd   Male               0.971
...          ...    ...                 ...
1223        mary  Femel               0.985
1224       saeid   Male               0.979
1225     ᴀᴍɪʀᴀʟɪ   None                 NaN
1226         ali   Male               0.942
1227  aristocles   None                 NaN

[1228 rows x 3 columns]

## Country

In [181]:
def country(first_name):
    try:
        info = name_data_set.search(first_name)['first_name']
        return max(info['country'], key=info['country'].get)
    except:    
        return None

In [182]:
df['Country'] = df['first_name'].apply(country)

In [183]:
df

      first_name Gender  Gender_Probability                    Country
0         sobhan   Male               0.923  Iran, Islamic Republic of
1           good   Male               0.713               Saudi Arabia
2           sima  Femel               0.878                     Israel
3            ali   Male               0.942                     Turkey
4           mhmd   Male               0.971                      Egypt
...          ...    ...                 ...                        ...
1223        mary  Femel               0.985              United States
1224       saeid   Male               0.979  Iran, Islamic Republic of
1225     ᴀᴍɪʀᴀʟɪ   None                 NaN                       None
1226         ali   Male               0.942                     Turkey
1227  aristocles   None                 NaN                       None

[1228 rows x 4 columns]

In [184]:
df['Country'].value_counts()

Country
Iran, Islamic Republic of    588
Saudi Arabia                 140
Morocco                      113
Egypt                         67
Turkey                        66
United States                 24
Iraq                          18
Italy                         12
Malaysia                      12
Algeria                        8
Bangladesh                     8
United Kingdom                 7
France                         7
Syrian Arab Republic           6
Russian Federation             5
Israel                         5
South Africa                   5
Netherlands                    5
Tunisia                        4
Germany                        3
Albania                        3
India                          3
Mexico                         3
Spain                          2
Yemen                          2
Belgium                        1
Afghanistan                    1
Bulgaria                       1
Nigeria                        1
Poland                         1
Croatia                        1
Hong Kong                      1
Kuwait                         1
Name: count, dtype: int64

In [185]:
df['Country'].isna().sum()

104

## country_probability

In [186]:
def country_probability(first_name):
    try:
        info = name_data_set.search(first_name)['first_name']
        country = max(info['country'], key=info['country'].get)
        return info['country'][country]
    except:    
        return None

In [187]:
df['Country_Probability'] = df['first_name'].apply(country_probability)

In [188]:
df

,first_name,Gender,Gender_Probability,Country,Country_Probability
0,sobhan,Male,0.923,"Iran, Islamic Republic of",0.610
1,good,Male,0.713,Saudi Arabia,0.257
2,sima,Femel,0.878,Israel,0.157
3,ali,Male,0.942,Turkey,0.250
4,mhmd,Male,0.971,Egypt,0.258
...,...,...,...,...,...
1223,mary,Femel,0.985,United States,0.309
1224,saeid,Male,0.979,"Iran, Islamic Republic of",0.655
1225,ᴀᴍɪʀᴀʟɪ,None,NaN,None,NaN
1226,ali,Male,0.942,Turkey,0.250
1227,aristocles,None,NaN,None,NaN

In [189]:
df['Country'].isna().sum()

104